### [DataFrame의 인덱스 다루기-3]
 - 행 인덱스를 정수형인덱스로  초기화
 - 기존 행 인덱스 ==> 컬럼으로 추가 시킴[기본값]
 - 메서드 : 변수명.eset_index()

In [16]:
#[1] 모듈 로딩
import pandas as pd

In [17]:
#[2] 데이터 준비
jumsu={'name' :['마징가','태권v','원더우먼'],
        'kor' :[89,100,99],
        'eng' :[70,80,99],
        'math':[99,88,77]}

In [18]:
#[3]
jumsuDF=pd.DataFrame(jumsu)

jumsuDF

   name  kor  eng  math
0   마징가   89   70    99
1   태권v  100   80    88
2  원더우먼   99   99    77

In [19]:
#[4] 행인덱스를 새롭게 생성
new_index=[0,1,2,'r0','r1','r2']

DF2=jumsuDF.reindex(new_index)
DF2

    name    kor   eng  math
0    마징가   89.0  70.0  99.0
1    태권v  100.0  80.0  88.0
2   원더우먼   99.0  99.0  77.0
r0   NaN    NaN   NaN   NaN
r1   NaN    NaN   NaN   NaN
r2   NaN    NaN   NaN   NaN

In [20]:
# [4]행인덱스 초기화
DF2=jumsuDF.reset_index()
DF2

   index  name  kor  eng  math
0      0   마징가   89   70    99
1      1   태권v  100   80    88
2      2  원더우먼   99   99    77

In [21]:
print(DF2.drop('index',axis=1))
print('---'*5)
print(DF2.drop(columns='index'))

   name  kor  eng  math
0   마징가   89   70    99
1   태권v  100   80    88
2  원더우먼   99   99    77
---------------
   name  kor  eng  math
0   마징가   89   70    99
1   태권v  100   80    88
2  원더우먼   99   99    77

In [22]:
#[5] 행 인덱스 초기화==> 기존행을 컬럼으로 추가 하지 않기
DF2=jumsuDF.reset_index(drop=True)
DF2

   name  kor  eng  math
0   마징가   89   70    99
1   태권v  100   80    88
2  원더우먼   99   99    77